Examinator/src/Catalogs/СтруктураБиблиотекиПользователейСУО/СтруктураБиблиотекиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураБиблиотекиПользователейСУО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Пользователи</owners>
  <owners>Catalog.КаталогМероприятийСУО</owners>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Видимость</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/БиблиотекаПользователейМеткиРесурсовСУО/БиблиотекаПользователейМеткиРесурсовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейМеткиРесурсовСУО</name>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/СтруктураБиблиотекиПользователейСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		// Удаляем все записи из регистра БиблиотекаПользователейМеткиРесурсовСУО,
		// где используется данная метка.
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Пользователь,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Ресурс,
		|	БиблиотекаПользователейМеткиРесурсовСУО.Фрагмент
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейМеткиРесурсовСУО КАК БиблиотекаПользователейМеткиРесурсовСУО
		|ГДЕ
		|	БиблиотекаПользователейМеткиРесурсовСУО.Метка = &Метка";
		
		Запрос.УстановитьПараметр("Метка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.БиблиотекаПользователейМеткиРесурсовСУО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Пользователь.Установить(ВыборкаДетальныеЗаписи.Пользователь);
			НаборЗаписей.Отбор.Ресурс.Установить(ВыборкаДетальныеЗаписи.Ресурс);
			НаборЗаписей.Отбор.Фрагмент.Установить(ВыборкаДетальныеЗаписи.Фрагмент);
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВебКабинетСУ.Используется() Тогда
		
		ДополнительныеСвойства.Вставить("РаспределитьОбновлениеВебКабинетаПоПользователям", Истина);
		ДополнительныеСвойства.Вставить("ИмяОбъектаМетаданныхОбновленияВебКабинета", "РегистрСведений.БиблиотекаПользователейСУО");
		
		ДополнительныеСвойства.Вставить("ПользователиДоЗаписи",
			Новый Массив);
			
		ДополнительныеСвойства.Вставить("ПользователиПослеЗаписи",
			Справочники.СтруктураБиблиотекиПользователейСУО.ПользователиРаздела(Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
	
#КонецЕсли
